guides/cursor/baselines/gotenberg_runs/k6_gotenberg_20260618_011715.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load_test_pprof.js
        output: -

     scenarios: (100.00%) 1 scenario, 48 max VUs, 1m5s max duration (incl. graceful stop):
              * steady: 48 looping VUs for 35s (gracefulStop: 30s)

time="2026-06-18T01:17:15+05:30" level=info msg="gotenberg load: 48 VUs × 35s, scenario=tagged_ecdsa, skipNetworkIdle=true" source=console

running (0m01.0s), 48/48 VUs, 7 complete and 0 interrupted iterations
steady   [   3% ] 48 VUs  01.0s/35s

running (0m02.0s), 48/48 VUs, 29 complete and 0 interrupted iterations
steady   [   6% ] 48 VUs  02.0s/35s

running (0m03.0s), 48/48 VUs, 49 complete and 0 interrupted iterations
steady   [   9% ] 48 VUs  03.0s/35s

running (0m04.0s), 48/48 VUs, 58 complete and 0 interrupted iterations
steady   [  11% ] 48 VUs  04.0s/35s

running (0m05.0s), 48/48 VUs, 69 complete and 0 interrupted iterations
steady   [  14% ] 48 VUs  05.0s/35s

running (0m06.0s), 48/48 VUs, 87 complete and 0 interrupted iterations
steady   [  17% ] 48 VUs  06.0s/35s

running (0m07.0s), 48/48 VUs, 100 complete and 0 interrupted iterations
steady   [  20% ] 48 VUs  07.0s/35s

running (0m08.0s), 48/48 VUs, 115 complete and 0 interrupted iterations
steady   [  23% ] 48 VUs  08.0s/35s

running (0m09.0s), 48/48 VUs, 129 complete and 0 interrupted iterations
steady   [  26% ] 48 VUs  09.0s/35s

running (0m10.0s), 48/48 VUs, 145 complete and 0 interrupted iterations
steady   [  29% ] 48 VUs  10.0s/35s

running (0m11.0s), 48/48 VUs, 163 complete and 0 interrupted iterations
steady   [  31% ] 48 VUs  11.0s/35s

running (0m12.0s), 48/48 VUs, 180 complete and 0 interrupted iterations
steady   [  34% ] 48 VUs  12.0s/35s

running (0m13.0s), 48/48 VUs, 199 complete and 0 interrupted iterations
steady   [  37% ] 48 VUs  13.0s/35s

running (0m14.0s), 48/48 VUs, 200 complete and 0 interrupted iterations
steady   [  40% ] 48 VUs  14.0s/35s

running (0m15.0s), 48/48 VUs, 219 complete and 0 interrupted iterations
steady   [  43% ] 48 VUs  15.0s/35s

running (0m16.0s), 48/48 VUs, 238 complete and 0 interrupted iterations
steady   [  46% ] 48 VUs  16.0s/35s

running (0m17.0s), 48/48 VUs, 256 complete and 0 interrupted iterations
steady   [  49% ] 48 VUs  17.0s/35s

running (0m18.0s), 48/48 VUs, 271 complete and 0 interrupted iterations
steady   [  51% ] 48 VUs  18.0s/35s

running (0m19.0s), 48/48 VUs, 288 complete and 0 interrupted iterations
steady   [  54% ] 48 VUs  19.0s/35s

running (0m20.0s), 48/48 VUs, 303 complete and 0 interrupted iterations
steady   [  57% ] 48 VUs  20.0s/35s

running (0m21.0s), 48/48 VUs, 318 complete and 0 interrupted iterations
steady   [  60% ] 48 VUs  21.0s/35s

running (0m22.0s), 48/48 VUs, 333 complete and 0 interrupted iterations
steady   [  63% ] 48 VUs  22.0s/35s

running (0m23.0s), 48/48 VUs, 343 complete and 0 interrupted iterations
steady   [  66% ] 48 VUs  23.0s/35s

running (0m24.0s), 48/48 VUs, 357 complete and 0 interrupted iterations
steady   [  69% ] 48 VUs  24.0s/35s

running (0m25.0s), 48/48 VUs, 369 complete and 0 interrupted iterations
steady   [  71% ] 48 VUs  25.0s/35s

running (0m26.0s), 48/48 VUs, 383 complete and 0 interrupted iterations
steady   [  74% ] 48 VUs  26.0s/35s

running (0m27.0s), 48/48 VUs, 400 complete and 0 interrupted iterations
steady   [  77% ] 48 VUs  27.0s/35s

running (0m28.0s), 48/48 VUs, 421 complete and 0 interrupted iterations
steady   [  80% ] 48 VUs  28.0s/35s

running (0m29.0s), 48/48 VUs, 439 complete and 0 interrupted iterations
steady   [  83% ] 48 VUs  29.0s/35s

running (0m30.0s), 48/48 VUs, 456 complete and 0 interrupted iterations
steady   [  86% ] 48 VUs  30.0s/35s

running (0m31.0s), 48/48 VUs, 475 complete and 0 interrupted iterations
steady   [  89% ] 48 VUs  31.0s/35s

running (0m32.0s), 48/48 VUs, 493 complete and 0 interrupted iterations
steady   [  91% ] 48 VUs  32.0s/35s

running (0m33.0s), 48/48 VUs, 500 complete and 0 interrupted iterations
steady   [  94% ] 48 VUs  33.0s/35s

running (0m34.0s), 48/48 VUs, 513 complete and 0 interrupted iterations
steady   [  97% ] 48 VUs  34.0s/35s

running (0m35.0s), 48/48 VUs, 535 complete and 0 interrupted iterations
steady   [ 100% ] 48 VUs  35.0s/35s

running (0m36.0s), 29/48 VUs, 554 complete and 0 interrupted iterations
steady ↓ [ 100% ] 48 VUs  35s

running (0m37.0s), 09/48 VUs, 574 complete and 0 interrupted iterations
steady ↓ [ 100% ] 48 VUs  35s
time="2026-06-18T01:17:53+05:30" level=info msg="gotenberg load done (started 2026-06-17T19:47:15.767Z)" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(99)<30000' p(99)=5.22s

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1749    46.828441/s
    checks_succeeded...: 100.00% 1749 out of 1749
    checks_failed......: 0.00%   0 out of 1749

    ✓ status is 200
    ✓ response is pdf
    ✓ response has content

    CUSTOM
    active_latency.................: avg=2986.694118 min=1397     med=2818   max=4916  p(90)=3850.2 p(95)=4091.4  p(99)=4463.24
    errors.........................: 0.00% 0 out of 583
    hft_latency....................: avg=4260.5      min=3277     med=3996   max=5421  p(90)=5212   p(95)=5257.5  p(99)=5383   
    pdf_generation_time............: avg=2962.19211  min=447      med=2863   max=5732  p(90)=4099.6 p(95)=4414.4  p(99)=5226.78
    retail_latency.................: avg=2886.262712 min=447      med=2803.5 max=5732  p(90)=4077   p(95)=4327.25 p(99)=4907.5 

    HTTP
    http_req_duration..............: avg=2.95s       min=668.97µs med=2.85s  max=5.73s p(90)=4.09s  p(95)=4.41s   p(99)=5.22s  
      { expected_response:true }...: avg=2.95s       min=668.97µs med=2.85s  max=5.73s p(90)=4.09s  p(95)=4.41s   p(99)=5.22s  
    http_req_failed................: 0.00% 0 out of 584
    http_reqs......................: 584   15.636255/s

    EXECUTION
    iteration_duration.............: avg=2.98s       min=448.13ms med=2.86s  max=5.83s p(90)=4.13s  p(95)=4.52s   p(99)=5.54s  
    iterations.....................: 583   15.60948/s
    vus............................: 9     min=9        max=48
    vus_max........................: 48    min=48       max=48

    NETWORK
    data_received..................: 25 MB 670 kB/s
    data_sent......................: 20 MB 535 kB/s



running (0m37.3s), 00/48 VUs, 583 complete and 0 interrupted iterations
steady ✓ [ 100% ] 48 VUs  35s